packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000052a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CertificateStatusIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>52</pkif:RequestId>
        <pkif:Timestamp>2020-07-22T02:05:03.774840+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <elem:CertificateStatusRequest xmlns:xe="http://www.w3.org/2001/04/xmlenc#" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
  <elem:KeyGeneratorType>software</elem:KeyGeneratorType>
  <elem:CertificateSerialNo>3319000000005401</elem:CertificateSerialNo>
  <elem:CustomerId>6D3142</elem:CustomerId>
  <elem:Timestamp>2020-07-22T02:05:03.774840+03:00</elem:Timestamp>
  <elem:RequestId>52</elem:RequestId>
  <elem:Environment>customertest</elem:Environment>
  <xd:Signature>
    <xd:SignedInfo>
      <xd:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
      <xd:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
      <xd:Reference URI="">
        <xd:Transforms>
          <xd:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
          <xd:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
        </xd:Transforms>
        <xd:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
        <xd:DigestValue>g1T4I4n8kzN39arDCwr/rZhboq4=</xd:DigestValue>
      </xd:Reference>
    </xd:SignedInfo>
    <xd:SignatureValue>eZPvT4cdTmvNaAqeDgQ0r1TezFXCXwxrZD6093e4x8Nhs4QsIMesUfaNEMn/af+x
uGlIkvzgYuoYSx2Vn6fblNLo3OcfKrTfacocZoDEWYUqAipqxvnUk430Y2ce0AM9
NCOGdqsZa2wX9ad58KuYqFLeOXveOrwHE2+yzDetBU/QzMvh1Ojd/cke84MoKaaL
gGLBAPENjKs0ZPPCqfcl6sRcJri17iyV/ZT6q+dyFGAAZGzO+mUKdKkIBtVpPfFs
fw+k49MrDkBbPaED6GpXAULntzrBkXU9Bulz2Cz1RorhSaH6yWjfiJy4Zx7Dh5d4
JvDvxn9Bn9c4XZ8hLvltbA==</xd:SignatureValue>
    <xd:KeyInfo>
      <xd:X509Data>
        <xd:X509Certificate>MIID3DCCAsSgAwIBAgIHC8qc6AKFGTANBgkqhkiG9w0BAQsFADCBmjEQMA4GA1UE
AxMHREJHU1dESzELMAkGA1UEBhMCREsxEzARBgNVBAcTCkNvcGVuaGFnZW4xEDAO
BgNVBAgTB0Rlbm1hcmsxGjAYBgNVBAoTEURhbnNrZSBCYW5rIEdyb3VwMRwwGgYD
VQQLExNEYW5za2UgQmFuayBEZW5tYXJrMRgwFgYDVQQFEw82MTEyNjIyODc3MzAx
MDEwHhcNMTYxMTI5MDc1OTQ1WhcNMTgxMTI5MDc1OTQ1WjBuMRYwFAYDVQQDEw1N
QU5VIFBFTFRPTkVOMQswCQYDVQQGEwJESzERMA8GA1UEChMIVFNUIEJJQkkxNDAy
BgNVBAUTK1NFLU5SL0RBQkE6MDAyODIxMTcxNi1BR1I6MjE0NTI5LVVTUjoxMTYz
NjkwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDHAOEDApDgPZaDThCu
Jnjnk5cQD0DRRXVWp9XRT6Lbrcx+V1XAKHtkofq4MTlw+yVtkDlsBXsRgbHJSxea
2iCVy8Iiper5X1fJYz8IvWvGE+agaJznr3YZzAebSQTMLeLgHb2jhpLRhCt95joA
Fx1F1xooTmeXNfk5R+aVO+aYhuRaHG7mBwfIKyQK7wmF20DtJXJ5nnV3ClM24tU2
UW7r+vNhedXS3bT78I96GuJXjhyt5vUCBrbesVwOY8IbSjUx+gImXmRq1sYIchd2
8nHfZNGgtQmFw4/pueR/ApE4x2lHseSE3ARaVKsFFmZALz7iVyfx63E2hAC7gbDF
ircxAgMBAAGjUjBQMB8GA1UdIwQYMBaAFA7mcPtCSqVAKvGKB0mdxNijbS0jMB0G
A1UdDgQWBBQkCFLiwXnrzLJPypi4fMrU4MKltTAOBgNVHQ8BAf8EBAMCBsAwDQYJ
KoZIhvcNAQELBQADggEBABC4KlXtygCjn2dq5JNTewBFIjGsJs6ZT0EpwojBOs4H
g4ejk+tSsb9FT3FpRJh8iGUG/XYVci+ATARCWvAAl0pxXsEr3ogNkiwADjsMWitq
g3yoWYHvEMPaITmSMlcsZETtVzJ01p0nPiPOn71VW/eZVi2BWrLhzxb6ZfcOkomL
csAMl7rVEwhvgkojSw40xMd3WCQA8gfmLg35Ly5wh3p27naSb5RZDH0lHr8gIo+M
KSbST12DE67lZdZuu1Yp1svH5Pru+NhvHpKQ8Fk5oRKxV3g7hxpMFWAzr6c7j681
qFCfPtxssjugjiQ6JHHpXsT7AUMPEJUFxFGYQYcSgdc=</xd:X509Certificate>
        <xd:X509IssuerSerial>
          <xd:X509IssuerName/>
          <xd:X509SerialNumber/>
        </xd:X509IssuerSerial>
      </xd:X509Data>
    </xd:KeyInfo>
  </xd:Signature>
</elem:CertificateStatusRequest></pkif:CertificateStatusIn>
  </soapenv:Body>
</soapenv:Envelope>